数据挖掘(Data Mining)就是从大量的数据中，提取隐藏在其中的，事先不知道的、但潜在有用的信息的过程。
数据挖掘的目标是建立一个决策模型，根据过去的行动数据来预测未来的行为。比如分析一家公司的不同用户对公司产品的购买情况，进而分析出哪一类客户会对公司的产品有兴趣。在讲究实时、竞争激烈的网络时代，若能事先破解消费者的行为模式，将是公司获利的关键因素之一。
数据挖掘是一门交叉学科，它涉及了数据库，人工智能，统计学，可视化等不同的学科和领域。

数据挖掘是数据库中知识发现(knowledge discovery in database, KDD)不可缺少的一部分，而KDD是将未加工的数据转换为有用信息的整个过程，
该过程包括一系列转换步骤， 从数据的预处理到数据挖掘结果的后处理。


用户画像推荐,利用机器学习和数据挖掘


数据清理
消除噪声和不一致的数据；
数据集成
多种数据源可以组合在一起；
数据选择
从数据库中提取与分析任务相关的数据；
数据变换
通过汇总或聚集操作，把数据变换和统一成适合挖掘的形式；
数据挖掘
基本步骤，使用智能方法提取数据模式；
模式评估
根据某种兴趣度，识别代表知识的真正有趣的模式；
知识表示
使用可视化和知识表示技术，向用户提供挖掘的知识。



数据挖掘的步骤
			数据分析-特征工程-建模调参-模型融合



