自我提升的8个好习惯:

提升技能，打造一技之长

					有人说，让自己变得不可替代的方式有两种：一种是做别人做不了或者不愿做的事情；一种是把人人都能做的事情做到顶尖。
					提升能力，打磨专业，拥有一技之长，掌握稀缺技能，是精进自己的好办法。
坚持多做不喜欢但应该做的事

					勇敢尝试自己并不擅长的事情，是一种成长和蜕变。
					坚持多做不喜欢但应该做的事，一直做下去，就会有意想不到的惊喜。当你有了改变的动力，人自会焕然一新。
先处理情绪，再处理事情

					遇到事情，先处理情绪，后处理事情。情绪处理不好，事情只会更糟糕。
					有情绪是本能，能控制情绪才是本事。遇事控制好情绪，拒绝情绪化，保持冷静和理性。一个人只有能很好地控制情绪，才能控制人生。
凡事先明确目标，再行动

					比起着急赶路，更重要的是先做好充足的准备，制定好缜密的计划。无论任何时候，做任何事情，先明确目标以后再出发、再努力。
					否则到了最后，不过是一种“伪努力”，感动了自己却徒劳无获。

独立思考，理性分析

					如今，我们接收信息的途径快捷又庞杂。我们要清楚地知道自己的目标，理性从自身角度分析，不被外界事物干扰。
					一个人能独立思考，可以获得快速成长。
直面困难不逃避

					一个人未来的样子藏在当下的坚持里。困难并不可怕，可怕的是遭遇困难时，首先想到的不是面对而是逃避。
					很多时候击败我们的不是困难，而是我们脆弱敏感的玻璃心。真正成熟的人不会让自己轻易地被困难和挫折打败，而是想办法积极地解决它。
每天学习1小时

					养成终身学习的习惯，每天留出1小时的时间用来自我充电，不断学习新事物，与时俱进。
					“学习的真正目的是追求智慧，而非单纯的知识。”日积月累，心灵便会变得更加丰盈。
心怀希望，无畏挫折

					人生就是一个尝试和体验的过程，不要害怕失败，也不要害怕做决定。
					挫折背后是一个更强大的自己，失败背后是一个更优秀的自己。
					自我提升从来都不是一件容易的事。愿我们都能从小事做起，一生向前，不负期待。

珍惜时间最好的方式:

1多读书

				　　读书对一个人的重要性，不只在于习得新知识，更在于它能帮助我们保持深度思考的能力，继而获得更快的成长。

				　　有句话说得好：“我读书越多，书籍就使我和世界越接近，生活对我也变得越加有意义。”对有阅读习惯的人而言，当他们拿起书，也就拿起了攀登更高处的梯子。
				  
				　　有空时，记得多读书。读书是为自己的心注入更多光亮的过程。我们所读过的每一本书，都将引领我们走向更美好的明天。

2多争气

					　　想让生活朝着更好的方向发展，就要以积极的心态处事，遇到难题时，勤思考、多争气。

					　　管理情绪，就是在管理人生。业务上遇到了挑战，就努力提升自己的技能，强化自己的核心竞争力。感情中付出没有回应，就把精力用来好好爱自己，你总会遇到属于自己的幸福。当你多用积极的心态思考，自会发现难题的出路。

					　　常思进取和努力，带上笑容迎接每一个挑战，你其实就已经赢了。

3多行动

					　　解决问题需要实际行动。世界上最遥远的距离，是想到与做到之间的距离。真正的务实莫过于，把精力放到眼下的事物上，把心思用在当下的事情上。


					　　定目标的时候，配套拟定好分阶段实施计划，然后给自己一个明确的期限。也可以设定好奖惩机制，化压力为动力。从现在开始，以行动践行想法，就是对未来最好的成全。

					　　珍惜时间最好的方式，是用时间成就更好的自己。提升自己的学识，管理自己的情绪，让自己成为一个既有清晰目标也有高度执行力的人。共勉！					

丰富自己的5个好习惯:
多阅读


					阅读是一种从外部世界回归精神生活的过程，不仅开阔眼界，更能丰富内心。

					好的书籍，能把一代代前人的智慧传递给你，能让你从字里行间感受到辽阔的世界。

					也许读书不能立马帮你解决当下的难题，但那些你读过的书，终将融进你的骨子里，增长你的智慧、提升你的格局，让你成为一个有温度、有深度的人。


少熬夜


					很多人都知道，睡得好有利于身体健康。其实，规律的作息还能决定一个人的生活状态。

					晚上早点休息，保持充足的睡眠，第二天醒来拉开窗帘，让自己沐浴在清晨的阳光里，然后带着这份愉悦的心情去工作，自然也会更高效、更得心应手。 


					能控制早晨的人，方可控制人生。从今天起，早睡早起，养成一个良好的生活习惯，你的精力也会更充沛。


更积极


					你对世界的态度，决定了你会拥有怎样的世界。如果你总是否定自己，就会在负面情绪中越陷越深。当你开始肯定和鼓励自己，才能引导自己走出困境，越来越开朗。


					所以，多肯定自己吧，积极地拥抱你想要的生活。


多微笑


					微笑虽然是一种表情，但它有时候却比语言更有力量。

					当你笑起来的时候，不仅可以感染别人，还可以疗愈自己。当你带着笑容向前奔跑时，阳光自会如影随行。


多行动


					生活中，很多人都有拖延的习惯。殊不知，长此下去，个人的成长也会越来越慢。

			        如果你要健身，就从每天跑2公里开始；如果你要看书，就从每天看10页书开始……只有迈出第一步，才能打败惰性，书写精彩人生。					

让自己幸福的7个小方法:


面带微笑


					爱笑的人，运气不会差。有人说：“生活就像一面镜子，你对它笑，它就对你笑。”和家人、朋友、同事在一起，多多微笑，这样不仅可以给他人带来幸福感，还能给自己带来好心情。笑口常开，好运自来。

保持充足睡眠


					身体是本钱，只有身体好了，生活才能往更好的方向发展。下个决心，坚持规律作息，尽量不熬夜，早睡早起，既保证充足的睡眠，也能拥有积极快乐的生活，时间长了你自会体验到满满的幸福感。

做事不拖延


					做事最怕一个“拖”字。做好时间管理，把事情分出轻重缓急，知道自己应该先做什么，生活就会轻松很多。少点徘徊，多点果敢，当你真正告别拖延时，人生也许就会与众不同。

保持运动


					运动能使人产生愉悦的感觉，能增强人的体魄，锻造你的身材。越是经常运动的人，身体越是健康。当你用运动唤醒身体时，也是唤醒了一个全新的自己。生命不息，运动不止。

记录生活中的美好事物


					“生活不是缺少美，而是缺少发现美的眼睛”。美好的事物值得被记录，遇到美丽的风景，可以拍下来往后回味；遇到有趣的片段，可以写在日记本里作为纪念。发现美、留住美、回味美，也会让心情越来越美。

保持学习


					有句话说：“你的问题主要是，读书不多，而想得太多。”不要让自己想的比做的多，不断学习，不断提升，才能保持领先，保持自己的竞争力。

多多陪伴家人


					工作再繁忙，也要多回家陪伴父母和家人。幸福的人生，莫过于有人问你粥可温，有人为你立黄昏；有家可回，有人在等，有盏灯会为你守候。有家人陪伴，就是最好的幸福。


调整生活状态的4种方法:

收回分散的精力

					　　很多时候，我们习惯于把注意力过多地放在外界的人与事上。要么盯着别人的成就与所得，在攀比中日渐失衡；要么太过在意别人的看法，从而心生种种焦虑。

					　　在自信心不足的情况下，分散的精力容易让人的状态不断下滑，变得越来越消极。

					　　当你不再把宝贵的精力浪费在不必要之处，不再过度关注别人的动态，你会发现，原来生活可以回归简单自在的模样。

整理好自己的情绪

					　　在生活中，我们会遇到有违心意的事，会做错一些事，或者错过一些重要的机会。

					　　但是，没有任何一种选择，会带来一个十全十美的人生。既然总会有遗憾，也总会有缺陷，就不必去纠结那些已经无法回头和重走的路。

					　　调整好自己的情绪，做到“有事心不乱，大事心不畏，小事心不怠”。别让坏情绪毁了我们用心珍惜的关系，也别让坏情绪拖累了你的人生。


管理好自己

					　　自我管理是多个方面的，包括对外在形象的管理，对作息节奏的管理，还有对思维方式的管理。这都体现了一个人自我约束的自律能力，而自律是治愈一切的良药。

					　　所有看似风光的美丽背后，都藏着无尽的汗水；所有令人羡慕的成就背后，都是不一般的自律。当你能够做到高度自律，你的生活将更加健康、灵魂将更加充实。

					　　沉下心来管理好自己，你会从中慢慢找到生活的掌控感。等心态变乐观了，心胸变开阔了，即使面对再复杂的问题，也能从容有余。

去做你一直想做的事

					　　如果有些事你一直想做却没有付诸行动，大概率是因为你害怕失败。那何时适合开始呢？一个可供参考的答案是，在你对生活感觉迷茫找不到方向的时候。

					　　有句话说：“身陷低谷时，往往就是人生转折点的开始。”人在低谷时，可以尝试主动去迎接挑战，寻求改变。很多事，你不试一试，都不知道自己可以有多优秀。

					　　无论你面临什么样的困境，只要坚持自我调整，就不会被困在原地。好的生活状态，是失意时扛得住，得意时稳得住。愿我们都能积极乐观地面对生命中的风雨，勇往直前，活出最好的自己。

丰富自己最好的方式：

1

丰富眼界　

					　　当你见过高山的巍峨、大海的广阔，体会到天地的无垠，你就会变得谦逊；当你见识过不同的风土人情，你就会发现这世上有无数种生活。
					　　“人生就是一个见天地、见他人、见自己的过程。”只有当你见识更多了，眼界丰富了，人生才会变得更宽广和辽阔。





2

丰富技能

					　　有人问：“从低谷中最先走出来的是哪种人？”有个高赞回答是：“一直在努力丰富技能的人。”
					　　成功没有一蹴而就，我们需要具备足够的耐心，去丰富自己的技能。只有自己强大起来，机遇才会随之而来。保持学习、丰富技能，能让自己拥有更强的竞争力，掌握人生主动权。





3

丰富生活

						　　看过一句话：“所谓生活乐趣，就是用意趣之心去对待生活中的万事万物，并挖掘其中的美好，为我们所用。”
						　　其实只要拥有一颗热爱生活的心，懂得在琐碎日常中提炼美好，注入心思，那么我们的生活就会越来越有质量。你可以不是玫瑰，但一定要芬芳；你可以不野心勃勃，但一定要成为自己的光。





4

丰富格局

					　　生活高低起伏，谁都免不了会遇到一些不顺心的事。真正大格局的人，不会动辄生气抱怨，更不会让坏情绪肆意蔓延。
					　　人的格局越大、阅历越多，越会懂得跳出自我的局限性，以积极的心态看待人生。不要让情绪的阴霾，遮盖了自己的晴空。往后余生，愿我们都能学会丰富自己的格局，活成最好的自己。



接下来的计划：
			
						下份工作的规划思考
						当前工作的总结定位
						需要提升的技能
						主业副业都要有 (钱生钱)
						思考、阅读、运动
						新房装修规划





